app/controllers/api/v1/restaurants_controller.rb

      def show
        restaurant = Restaurant.find_by(url: params[:url])
---
SELECT "restaurants".* FROM "restaurants" WHERE "restaurants"."url" = $1 LIMIT $2  [["url", "13"], ["LIMIT", 1]]