app/controllers/api/v1/restaurants_controller.rb

SELECT "restaurants".* FROM "restaurants"
---
      def index
        restaurants = Restaurant.all

SELECT "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
      def show
        restaurant = Restaurant.find(params[:id])

INSERT INTO "restaurants" ("name", "description", "created_at", "updated_at", "url") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
---
      def create
        restaurant = Restaurant.new(restaurant_params)

        if restaurant.save

SELECT "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = $1 LIMIT $2  [["id", 13], ["LIMIT", 1]]
UPDATE "restaurants" SET "name" = $1, "updated_at" = $2 WHERE "restaurants"."id" = $3  [["name", "Resturant Updated"], ["updated_at", "2021-03-24 04:40:06.578432"], ["id", 13]]
---
      def update
        restaurant = Restaurant.find(params[:id])

        if restaurant.update(restaurant_params)

SELECT "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "restaurants" WHERE "restaurants"."id" = $1  [["id", 14]]
---
      def destroy
        restaurant = Restaurant.find(params[:id])

        if restaurant.destroy