app/controllers/api/v1/reviews_controller.rb

INSERT INTO "reviews" ("user_name", "restaurant_id", "description", "score", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["user_name", "Jhonatan Sarrazola"], ["restaurant_id", 1], ["description", "Testing"], ["score", 3], ["created_at", "2021-03-25 03:34:56.125819"], ["updated_at", "2021-03-25 03:34:56.125819"]]
---
      def create
        review = restaurant.reviews.new(review_params)

        if review.save

SELECT "reviews".* FROM "reviews" WHERE "reviews"."id" = $1 LIMIT $2  [["id", 14], ["LIMIT", 1]]
DELETE FROM "reviews" WHERE "reviews"."id" = $1  [["id", 14]]
---
      def destroy
        review = Review.find(params[:id])

        if review.destroy

SELECT "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
      def restaurant
        @restaurant = Restaurant.find(params[:restaurant_id])